In [1]:
import pandas as pd
import numpy as np

# Pandas utility functions

### Just like numpy, pandas also has a few utility functions to identify and detect null values.

In [2]:
pd.isnull(np.nan)

True

In [3]:
pd.isnull(None)

True

In [4]:
pd.isna(np.nan)

True

In [5]:
pd.isna(None)

True

### The opposite ones also exist:

In [6]:
pd.notnull(None)

False

In [7]:
pd.notnull(np.nan)

False

In [8]:
pd.notna(None)

False

In [9]:
pd.notna(5)

True

### These function also work with Series and DataFrames

In [10]:
pd.notnull(pd.Series([1, np.nan, 7]))

0     True
1    False
2     True
dtype: bool

In [11]:
pd.isnull(pd.Series([1, np.nan, 7]))

0    False
1     True
2    False
dtype: bool

In [12]:
pd.isnull(pd.DataFrame({
    'Column A' : [1, np.nan, 7],
    'Column B' : [np.nan, 2, 3],
    'Column C' : [np.nan, 2, np.nan]
}))

   Column A  Column B  Column C
0     False      True      True
1      True     False     False
2     False     False      True

# Pandas Operations with Missing Values

### Pandas manages missing values more gracefully than numpy. nans will no longer behave as "viruses", and operations will just ignore them completely:

In [13]:
pd.Series([1, 2, np.nan]).count()

2

In [14]:
pd.Series([1, 2, np.nan]).sum()

3.0

In [15]:
pd.Series([6, 2, np.nan]).mean()

4.0

# Filtering missing data

In [16]:
S = pd.Series([1, 2, 3, np.nan, np.nan, 4])

In [17]:
pd.notnull(S)

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [18]:
pd.isnull(S)

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [19]:
pd.isna(S)

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [20]:
pd.notna(S)

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

### But both notnull and isnull are also methods of Series and DataFrames, so we could use it that way:

In [21]:
S.notnull()

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [22]:
S.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [23]:
S.isna()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [24]:
S.notna()

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

# Dropping null values

In [25]:
S

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [26]:
S.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

# Dropping null values on DataFrames

In [27]:
df = pd.DataFrame({
    'Column A' : [1, np.nan, 30, np.nan],
    'Column B' : [2, 8, 31, np.nan],
    'Column C' : [np.nan, 95 , 6, 101],
    'Column D' : [1, 2, 3, 4],
})
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         1
1       NaN       8.0      95.0         2
2      30.0      31.0       6.0         3
3       NaN       NaN     101.0         4

In [28]:
df.shape

(4, 4)

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column A  2 non-null      float64
 1   Column B  3 non-null      float64
 2   Column C  3 non-null      float64
 3   Column D  4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 256.0 bytes

In [30]:
df.isnull()

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

In [31]:
df.isnull().sum()

Column A    2
Column B    1
Column C    1
Column D    0
dtype: int64

In [32]:
df.dropna()

   Column A  Column B  Column C  Column D
2      30.0      31.0       6.0         3

In [33]:
df.dropna(axis = 1) #axis = 1 --> column

   Column D
0         1
1         2
2         3
3         4

In [34]:
df2 = pd.DataFrame({
    'Column A': [1, np.nan, 30],
    'Column B': [2, np.nan, 31],
    'Column C': [np.nan, np.nan, 100]
})
df2

   Column A  Column B  Column C
0       1.0       2.0       NaN
1       NaN       NaN       NaN
2      30.0      31.0     100.0

In [35]:
df.dropna(how = 'all')

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         1
1       NaN       8.0      95.0         2
2      30.0      31.0       6.0         3
3       NaN       NaN     101.0         4

In [36]:
df2.dropna(how='any')  # default behavior

   Column A  Column B  Column C
2      30.0      31.0     100.0

In [37]:
df.dropna(thresh=3, axis = 'columns')

   Column B  Column C  Column D
0       2.0       NaN         1
1       8.0      95.0         2
2      31.0       6.0         3
3       NaN     101.0         4

# Filling null values

In [38]:
S

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

### Filling null values with arbitary value

In [39]:
S.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    4.0
dtype: float64

In [40]:
S.fillna(S.mean())

0    1.0
1    2.0
2    3.0
3    2.5
4    2.5
5    4.0
dtype: float64

### Filling null with contiguous (close) values

In [41]:
S.fillna(method = 'ffill') #The method argument is used to fill null values with other values close to that null

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [42]:
S.fillna(method = 'bfill')

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

In [ ]:
This can still leave null values at the extremes of the Series/DataFrame

In [43]:
pd.Series([np.nan, 3, np.nan, 9]).fillna(method = 'ffill')

0    NaN
1    3.0
2    3.0
3    9.0
dtype: float64

In [44]:
pd.Series([np.nan, 3, np.nan, 9]).fillna(method = 'bfill')

0    3.0
1    3.0
2    9.0
3    9.0
dtype: float64

In [45]:
pd.Series([1, np.nan, 3, np.nan, np.nan]).fillna(method = 'bfill')

0    1.0
1    3.0
2    3.0
3    NaN
4    NaN
dtype: float64

### Filling null values on DataFrame

In [46]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         1
1       NaN       8.0      95.0         2
2      30.0      31.0       6.0         3
3       NaN       NaN     101.0         4

In [47]:
df.fillna({'Column A': 14, 'Column B': 99, 'Column C': df['Column C'].mean()})

   Column A  Column B    Column C  Column D
0       1.0       2.0   67.333333         1
1      14.0       8.0   95.000000         2
2      30.0      31.0    6.000000         3
3      14.0      99.0  101.000000         4

In [48]:
df.fillna(method = 'ffill', axis = 0)

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         1
1       1.0       8.0      95.0         2
2      30.0      31.0       6.0         3
3      30.0      31.0     101.0         4

In [49]:
df.fillna(method = 'bfill', axis = 1)

   Column A  Column B  Column C  Column D
0       1.0       2.0       1.0       1.0
1       8.0       8.0      95.0       2.0
2      30.0      31.0       6.0       3.0
3     101.0     101.0     101.0       4.0

# Checking if there are NAs

### Example 1: Checking the length

In [50]:
S.dropna().count()

4

In [51]:
missing_value = S.count() != len(S)
missing_value

True

In [52]:

len(S)

6

In [53]:
S.count()

4

In [54]:
#so we could just do 
missing_value = S.count() != len(S)
missing_value

True

### More Pyhtonic solutions any

In [55]:
# The methods any and all check if either there's any True value in a Series or all the values are True. 
# They work in the same way as in Python:
pd.Series([True, False, False]).any()

True

In [56]:
pd.Series([True, False, False]).all()

False

In [57]:
pd.Series([True, True, True]).all()

True

In [58]:
# The methods any and all check if either there's any True value in a Series or all the values are True. They work in the same way as in Python

In [59]:
S.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [60]:
S

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [61]:
# So we can just use the any method with the boolean array returned
pd.Series([1, np.nan]).isnull().any()

True

In [62]:
pd.Series([1, 2]).isnull().any()

False

In [63]:
# A more strict version would check only the values of the Series
S.isnull().values

array([False, False, False,  True,  True, False])

In [64]:
S.isnull().values.any()

True